{
  "traces": [],
  "train": [],
  "demos": [],
  "signature": {
    "instructions": "python\n# Task Instructions\n\n# Task Description:\n# The task is to generate a time-blocked plan that preserves exact event times and locations.\n# The plan should be tailored to the agent's goal, personality, current situation, and relevant memories.\n# The task requires the ability to analyze the provided inputs, prioritize events and activities based on the agent's goal and personality, and create a clear sequence of events and activities.\n\n# Input Format:\n# The inputs are provided in a structured format, including:\n# - agent_goal: a string describing the agent's goal\n# - agent_personality: a string describing the agent's personality traits (e.g., analytical, social, spontaneous)\n# - current_time: a string representing the current time in 12-hour format (e.g., 03:40 PM)\n# - current_location: a tuple representing the agent's current location in the format (x, y)\n# - recent_events: a list of strings describing recent events, including event times and locations\n# - relevant_memories: a list of strings describing relevant memories, including event details and outcomes\n\n# Task Objectives:\n# The primary objective of the task is to generate a time-blocked plan that preserves exact event times and locations.\n# The plan should be tailored to the agent's goal, personality, and current situation, and should include a clear sequence of events and activities.\n\n# Task Constraints:\n# The task has the following constraints:\n# - The plan should preserve exact event times and locations.\n# - The plan should be generated based on the provided inputs.\n# - The plan should be tailored to the agent's goal, personality, and current situation.\n\n# Task Requirements:\n# The task requires the following:\n# - The ability to analyze the provided inputs and generate a time-blocked plan that meets the task objectives and constraints.\n# - The ability to incorporate the agent's personality and goal into the plan.\n# - The ability to preserve exact event times and locations in the plan.\n\n# Task Strategy:\n# A generalizable strategy for solving this task is to:\n# 1. Analyze the provided inputs and identify the agent's goal, personality, and current situation.\n# 2. Generate a list of recent events and relevant memories that are relevant to the agent's goal.\n# 3. Prioritize the events and activities based on the agent's goal and personality.\n# 4. Create a time-blocked plan that includes a clear sequence of events and activities.\n# 5. Ensure that the plan preserves exact event times and locations.\n\n# Niche and Domain-Specific Factual Information:\n# The task requires knowledge of the following niche and domain-specific facts:\n# - The ability to understand and interpret the agent's goal, personality, and current situation.\n# - The ability to analyze and prioritize events and activities based on the agent's goal and personality.\n# - The ability to generate a time-blocked plan that preserves exact event times and locations.\n# - The importance of considering weather alerts and emergencies in the plan.\n# - The ability to incorporate backup plans and contingency measures into the plan.\n# - The ability to prioritize tasks based on their urgency and importance.\n# - The ability to consider the agent's personality traits when assigning tasks and allocating time.\n# - The ability to create a clear and concise plan that is easy to follow.\n\n# Task Evaluation Criteria:\n# The task will be evaluated based on the following criteria:\n# - The accuracy and relevance of the generated plan.\n# - The ability of the plan to preserve exact event times and locations.\n# - The ability of the plan to incorporate the agent's personality and goal.\n# - The clarity and concision of the plan.\n# - The ability of the plan to adapt to changing circumstances and emergencies.\n\n# Task Scoring:\n# The task will be scored based on the following criteria:\n# - 0.5: The plan is partially accurate and relevant, but fails to preserve exact event times and locations.\n# - 1.0: The plan is accurate and relevant, preserves exact event times and locations, and incorporates the agent's personality and goal.\n# - 1.5: The plan is highly accurate and relevant, preserves exact event times and locations, incorporates the agent's personality and goal, and is clear and concise.",
    "fields": [
      {
        "prefix": "Agent Goal:",
        "description": "Agent's high-level goal"
      },
      {
        "prefix": "Agent Personality:",
        "description": "Agent's personality traits"
      },
      {
        "prefix": "Current Time:",
        "description": "Current time (e.g., '2:30 PM')"
      },
      {
        "prefix": "Current Location:",
        "description": "Current location coordinates"
      },
      {
        "prefix": "Recent Events:",
        "description": "Recent invitations with exact times"
      },
      {
        "prefix": "Relevant Memories:",
        "description": "Relevant memories"
      },
      {
        "prefix": "Reasoning:",
        "description": "Explain time preservation"
      },
      {
        "prefix": "Plan:",
        "description": "Time-blocked plan with coordinates"
      }
    ]
  },
  "lm": null,
  "metadata": {
    "dependency_versions": {
      "python": "3.12",
      "dspy": "3.0.3",
      "cloudpickle": "3.1"
    }
  }
}
